app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "password", "screen_name", "email", "authorization_token") VALUES('2010-06-12 20:28:05', '2010-06-12 20:28:05', 'long_enough_password', 'new_screen_name', 'valid@example.com', NULL)
---
  def register
    @title = "Register"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM "users" WHERE ("users"."screen_name" = 'no such user' AND "users"."password" = 'electron') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-06-13 21:08:08', "authorization_token" = '56d1799d501a6ea5f0e612d22ddba211dc4066ae' WHERE "id" = 1
---
  def login
    @title = "Log in to Lebensold Space"
      if request.get?
        @user = User.new(:remember_me => cookies[:remember_me] || "0")
      elsif param_posted?(:user)
        @user = User.new(params[:user])
        user = User.find_by_screen_name_and_password(@user.screen_name, @user.password)
      if user
        user.login!(session)
        if @user.remember_me == "1"
          cookies[:remember_me] = { :value   => "1",
                                    :expires => 10.years.from_now }
          user.authorization_token = user.id
          user.save!